import '../planet.dart';

final List<Planet> planets = [
  Planet(
    name: 'عطارد',
    description:
        'عطارد هو أقرب كوكب إلى الشمس، وهو صغير من حيث الحجم وليس لديه جو.',
    image: 'assets/images/mercury.jpg',
    funFacts: [
      'عطارد ليس لديه جو.',
      'يوم عطارد أطول من سنته.',
      'تتراوح درجات الحرارة بين 430 درجة مئوية خلال النهار و -180 درجة مئوية ليلاً.',
    ],
  ),
  Planet(
    name: 'الزهرة',
    description:
        'الزهرة هو الكوكب الثاني في النظام الشمسي وغالبًا ما يُطلق عليه أخت الأرض بسبب حجمهما المشابه.',
    image: 'assets/images/venus.jpg',
    funFacts: [
      'الزهرة لديه درجات حرارة مرتفعة للغاية بسبب غلافه الجوي الكثيف.',
      'يوم واحد على الزهرة أطول من سنة واحدة على الزهرة.',
      'الزهرة يدور في الاتجاه المعاكس لبقية الكواكب.',
    ],
  ),
  Planet(
    name: 'الأرض',
    description: 'الأرض هي الكوكب الوحيد المعروف الذي يدعم الحياة.',
    image: 'assets/images/earth.jpg',
    funFacts: [
      'تشكل المياه حوالي 71% من سطح الأرض.',
      'تدور الأرض حول الشمس بسرعة 30 كم في الثانية.',
      'الأرض هي الكوكب الوحيد المعروف بوجود الحياة.',
    ],
  ),
  Planet(
    name: 'المريخ',
    description:
        'المريخ هو الكوكب الأحمر، ويشتهر بوجود الغبار والصخور الحمراء.',
    image: 'assets/images/mars.jpg',
    funFacts: [
      'المريخ لديه أكبر جبل في النظام الشمسي، وهو أوليمبوس مونس.',
      'لديه مواسم مشابهة لتلك الموجودة على الأرض.',
      'المريخ لديه غلاف جوي رقيق يتركز أساساً على ثاني أكسيد الكربون.',
    ],
  ),
  Planet(
    name: 'المشتري',
    description:
        'المشتري هو أكبر كوكب في النظام الشمسي ويتميز بجو مليء بالعواصف.',
    image: 'assets/images/jupiter.jpg',
    funFacts: [
      'يمتلك المشتري بقعة حمراء كبيرة، وهي في الواقع عاصفة عملاقة.',
      'لديه أكثر من 75 قمرًا، بما في ذلك غانيميد، أكبر قمر في النظام الشمسي.',
      'يمتلك المشتري حقل جاذبية قوي جدًا يجذب العديد من المذنبات والكويكبات.',
    ],
  ),
  Planet(
    name: 'زحل',
    description: 'زحل هو الكوكب المعروف بحلقاته الجميلة والمميزة.',
    image: 'assets/images/saturn.jpg',
    funFacts: [
      'تتكون حلقات زحل من جليد وصخور صغيرة.',
      'زحل هو الكوكب الثاني الأكبر في النظام الشمسي.',
      'يمكن رؤية حلقات زحل من خلال التلسكوب.',
    ],
  ),
  Planet(
    name: 'أورانوس',
    description:
        'أورانوس هو كوكب غازي يتميز بلونه الأزرق الفاتح بسبب وجود الميثان في غلافه الجوي.',
    image: 'assets/images/uranus.jpg',
    funFacts: [
      'أورانوس هو الكوكب الوحيد الذي يدور على جانبه.',
      'لديه حلقات أيضًا، لكنها ليست واضحة مثل حلقات زحل.',
      'يوم واحد على أورانوس يساوي حوالي 17 ساعة.',
    ],
  ),
  Planet(
    name: 'نبتون',
    description:
        'نبتون هو أبعد كوكب عن الشمس ويتميز بجو سريع الحركة وغيوم كثيفة.',
    image: 'assets/images/neptune.jpg',
    funFacts: [
      'يمتلك نبتون رياحًا عاتية تعتبر من أسرع الرياح في النظام الشمسي.',
      'توجد عواصف كبيرة على نبتون، مثل البقعة الداكنة.',
      'يستغرق نبتون حوالي 165 عامًا لإكمال دورة واحدة حول الشمس.',
    ],
  ),
];
